"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.PERSONS = void 0;
exports.PERSONS = {
    name: {
        male: {
            small: [
                'Иван',
                'Алексей',
                'Борис',
            ],
            medium: [
                'Михаил',
                'Сергей',
            ],
            large: [
                'Владимир',
                'Александр',
            ],
            extra_large: [
                'Артемий',
                'Анатолий',
            ],
        },
        female: {
            small: [
                'Мария',
                'Екатерина',
                'Дарья',
            ],
            medium: [
                'Анастасия',
                'Ирина',
            ],
            large: [
                'Виктория',
                'Евгения',
            ],
            extra_large: [
                'Светлана',
                'Людмила',
            ],
        },
    },
    surname: {
        male: {
            small: [
                'Смирнов',
                'Иванов',
                'Кузнецов',
            ],
            medium: [
                'Попов',
                'Соколов',
            ],
            large: [
                'Лебедев',
                'Новиков',
            ],
            extra_large: [
                'Морозов',
                'Васильев',
            ],
        },
        female: {
            small: [
                'Смирнова',
                'Иванова',
                'Кузнецова',
            ],
            medium: [
                'Попова',
                'Соколова',
            ],
            large: [
                'Лебедева',
                'Новикова',
            ],
            extra_large: [
                'Морозова',
                'Васильева',
            ],
        },
    },
    patronymic: {
        male: {
            small: [
                'Петрович',
                'Иванович',
            ],
            medium: [
                'Алексеевич',
                'Сергеевич',
            ],
            large: [
                'Владимирович',
                'Дмитриевич',
            ],
            extra_large: [
                'Николаевич',
                'Тимофеевич',
            ],
        },
        female: {
            small: [
                'Петровна',
                'Ивановна',
            ],
            medium: [
                'Алексеевна',
                'Сергеевна',
            ],
            large: [
                'Владимировна',
                'Дмитриевна',
            ],
            extra_large: [
                'Николаевна',
                'Тимофеевна',
            ],
        },
    },
};
